---
kind: property
id: P:Autodesk.Revit.DB.ThermalProperties.ThermalMass
source: html/5f66e430-8a45-39c2-e0f2-ab0456756721.htm
---
# Autodesk.Revit.DB.ThermalProperties.ThermalMass Property

The calculated thermal mass value.
 The unit is kilogram feet-squared per second squared kelvin (kg ft^2/(s^2 K)).

## Syntax (C#)
```csharp
public double ThermalMass { get; }
```